In [62]:
import pandas as pd
df = pd.read_csv('Book.csv')
print(df)

         DATE                MODEL  QUANTITY UNIT PRICE  SUB TOTAL  \
0    2/1/2025   HP CPUS i3/3RD GEN       6.0       4000      24000
1    2/1/2025   HP CPUS i3/4TH GEN      10.0       4500      45000
2    2/1/2025    HP CPUS CELERON 4       3.0       4000      12000
3    2/1/2025      HP CPUS PENTIUM       1.0       4000       4000
4    2/1/2025       HP CPUS I5/2ND       1.0       4500       4500
..        ...                  ...       ...        ...        ...
73  27/1/2025        IYAMA MONITOR       5.0       2500      12500
74  27/1/2025       DELL KEYBOARDS       9.0        200       1800
75  30/1/2025  HP CPU S i5/6 8/500       2.0       8500      17000
76  31/1/2025           LENOVO 11e       5.0       6000      30000
77        NaN                  NaN       NaN      TOTAL    2761700

    Unnamed: 5  Unnamed: 6 Unnamed: 7
0          NaN         NaN        NaN
1          NaN         NaN        NaN
2          NaN         NaN        NaN
3          NaN         NaN        NaN
4          NaN         NaN        NaN
..         ...         ...        ...
73         NaN         NaN        NaN
74         NaN         NaN        NaN
75         NaN         NaN        NaN
76         NaN         NaN        NaN
77         NaN         NaN        NaN

[78 rows x 8 columns]

In [63]:
df

,DATE,MODEL,QUANTITY,UNIT PRICE,SUB TOTAL,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,2/1/2025,HP CPUS i3/3RD GEN,6.0,4000,24000,NaN,NaN,NaN
1,2/1/2025,HP CPUS i3/4TH GEN,10.0,4500,45000,NaN,NaN,NaN
2,2/1/2025,HP CPUS CELERON 4,3.0,4000,12000,NaN,NaN,NaN
3,2/1/2025,HP CPUS PENTIUM,1.0,4000,4000,NaN,NaN,NaN
4,2/1/2025,HP CPUS I5/2ND,1.0,4500,4500,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
73,27/1/2025,IYAMA MONITOR,5.0,2500,12500,NaN,NaN,NaN
74,27/1/2025,DELL KEYBOARDS,9.0,200,1800,NaN,NaN,NaN
75,30/1/2025,HP CPU S i5/6 8/500,2.0,8500,17000,NaN,NaN,NaN
76,31/1/2025,LENOVO 11e,5.0,6000,30000,NaN,NaN,NaN
77,NaN,NaN,NaN,TOTAL,2761700,NaN,NaN,NaN

In [64]:
#to drop all unnamed columns
df = df.dropna(axis=1, how= 'all')
print(df)

         DATE                MODEL  QUANTITY UNIT PRICE  SUB TOTAL Unnamed: 7
0    2/1/2025   HP CPUS i3/3RD GEN       6.0       4000      24000        NaN
1    2/1/2025   HP CPUS i3/4TH GEN      10.0       4500      45000        NaN
2    2/1/2025    HP CPUS CELERON 4       3.0       4000      12000        NaN
3    2/1/2025      HP CPUS PENTIUM       1.0       4000       4000        NaN
4    2/1/2025       HP CPUS I5/2ND       1.0       4500       4500        NaN
..        ...                  ...       ...        ...        ...        ...
73  27/1/2025        IYAMA MONITOR       5.0       2500      12500        NaN
74  27/1/2025       DELL KEYBOARDS       9.0        200       1800        NaN
75  30/1/2025  HP CPU S i5/6 8/500       2.0       8500      17000        NaN
76  31/1/2025           LENOVO 11e       5.0       6000      30000        NaN
77        NaN                  NaN       NaN      TOTAL    2761700        NaN

[78 rows x 6 columns]

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   DATE        77 non-null     object
 1   MODEL       77 non-null     object
 2   QUANTITY    77 non-null     float64
 3   UNIT PRICE  78 non-null     object
 4   SUB TOTAL   78 non-null     int64
 5   Unnamed: 7  1 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 3.8+ KB

In [11]:
df.describe()

         QUANTITY     SUB TOTAL
count   77.000000  7.800000e+01
mean    15.714286  7.081282e+04
std     56.999736  3.111201e+05
min      1.000000  1.800000e+03
25%      1.000000  1.125000e+04
50%      3.000000  2.400000e+04
75%      8.000000  4.362500e+04
max    400.000000  2.761700e+06

In [66]:
df.count()

DATE          77
MODEL         77
QUANTITY      77
UNIT PRICE    78
SUB TOTAL     78
Unnamed: 7     1
dtype: int64

In [67]:
df.groupby('MODEL')['MODEL']

In [68]:
df.groupby(['MODEL', 'DATE'])['QUANTITY'].min()

MODEL                    DATE
ALL IN ONE FUJISTU       2/1/2025     1.0
ALL IN ONE FUJISTU i3    20/1/2025    1.0
ALL IN ONE FUJISTU i5/2  20/1/2025    1.0
ALL IN ONE HP            23/1/2025    3.0
ALL IN ONE LENOVO i3/2   20/1/2025    1.0
                                     ...
TOSHIBA R63              2/1/2025     3.0
TOSHIBA R73              4/1/2025     1.0
TOSHIBA i3/8             24/1/2025    1.0
TOSHIBA i5/3             24/1/2025    5.0
TOSHIBA i5/5             24/1/2025    1.0
Name: QUANTITY, Length: 76, dtype: float64

In [70]:
df.groupby('MODEL')['QUANTITY'].median()

MODEL
ALL IN ONE FUJISTU         1.0
ALL IN ONE FUJISTU i3      1.0
ALL IN ONE FUJISTU i5/2    1.0
ALL IN ONE HP              3.0
ALL IN ONE LENOVO i3/2     1.0
                          ...
TOSHIBA R63                3.0
TOSHIBA R73                1.0
TOSHIBA i3/8               1.0
TOSHIBA i5/3               5.0
TOSHIBA i5/5               1.0
Name: QUANTITY, Length: 61, dtype: float64

In [75]:
df.groupby(['MODEL', 'DATE'])['QUANTITY'].var()

MODEL                    DATE
ALL IN ONE FUJISTU       2/1/2025    NaN
ALL IN ONE FUJISTU i3    20/1/2025   NaN
ALL IN ONE FUJISTU i5/2  20/1/2025   NaN
ALL IN ONE HP            23/1/2025   NaN
ALL IN ONE LENOVO i3/2   20/1/2025   NaN
                                      ..
TOSHIBA R63              2/1/2025    NaN
TOSHIBA R73              4/1/2025    NaN
TOSHIBA i3/8             24/1/2025   NaN
TOSHIBA i5/3             24/1/2025   NaN
TOSHIBA i5/5             24/1/2025   NaN
Name: QUANTITY, Length: 76, dtype: float64